def get_categories(lang: str):
    data = {
        "ru": """
🛒 Основные категории:

• Для дома  
• Детские товары  
• Красота и уход  
• Гаджеты  
• Спорт и ЗОЖ  
• Для авто  
• Кухня  
• Домашние питомцы
""",

        "kg": """
🛒 Категориялар:

• Үй үчүн  
• Балдар товарлары  
• Кооздук жана кам көрүү  
• Гаджеттер  
• Спорт жана ЗОЖ  
• Авто товарлар  
• Ашкана  
• Үй жаныбарлары
""",

        "kz": """
🛒 Санаттар:

• Үйге арналған  
• Балаларға арналған тауар  
• Сұлулық және күтім  
• Гаджеттер  
• Спорт және ЗОЖ  
• Авто тауар  
• Ас үй  
• Үй жануарлары
"""
    }

    return data.get(lang, data["ru"])
