def get_categories(lang: str):
    data = {
        "ru": [
            "📦 Дом и кухня",
            "🎧 Электроника",
            "👶 Детские товары",
            "🐾 Товары для животных",
            "💪 Спорт и здоровье",
            "💄 Красота",
            "🧳 Путешествия",
        ],
        "kg": [
            "📦 Үй жана ашкана",
            "🎧 Электроника",
            "👶 Бала товарлары",
            "🐾 Жаныбарлар үчүн",
            "💪 Спорт жана ден соолук",
            "💄 Кооздук",
            "🧳 Саякат",
        ],
        "kz": [
            "📦 Үй және ас үй",
            "🎧 Электроника",
            "👶 Балалар тауарлары",
            "🐾 Жануарларға арналған",
            "💪 Спорт және денсаулық",
            "💄 Сұлулық",
            "🧳 Саяхат",
        ],
    }

    rows = data.get(lang, data["ru"])
    return "🛒 Категории товаров:\n\n" + "\n".join(f"• {i}" for i in rows)
