def premium_info(lang: str):
    data = {
        "ru": """
⭐ Премиум аналитика

В премиум входит:
• Глубокий анализ товара  
• Анализ конкурентов  
• Проверка спроса  
• Подбор идей и ниш  
• Рекомендации по рекламе  
• Личный менеджер

Скоро будет доступна покупка Premium.
""",

        "kg": """
⭐ Премиум аналитика

Премиум мүмкүнчүлүктөрү:
• Товарды терең анализдөө  
• Атаандаштарды изилдөө  
• Суроо-талапты текшерүү  
• Идея жана ниша тандоо  
• Реклама боюнча кеңеш  
• Жеке менеджер

Жакында жеткиликтүү болот.
""",

        "kz": """
⭐ Премиум аналитика

Премиум мүмкіндіктері:
• Тауарды терең талдау  
• Бәсекелестерді зерттеу  
• Сұранысты тексеру  
• Идеялар мен нишаларды таңдау  
• Жарнама бойынша ұсыныстар  
• Жеке менеджер

Жақында қолжетімді болады.
"""
    }

    return data.get(lang, data["ru"])
