@router.message(F.text == "Премиум 🚀")
async def premium_info(message: Message):
    t = get_texts(message.from_user.id)
    uid = message.from_user.id

    # Если премиум есть
    if has_active_premium(uid):
        until_ts, tariff = get_premium(uid)
        dt = datetime.fromtimestamp(until_ts).strftime("%d.%m.%Y")

        text = (
            f"🚀 У тебя активный Премиум-доступ.\n"
            f"Действует до: *{dt}*\n"
            f"Тариф: *{tariff}*\n\n"
            f"Ты можешь пользоваться всеми функциями без ограничений ❤️"
        )
        await message.answer(text, parse_mode="Markdown")
        return

    # Если премиума НЕТ — продаём
    text = (
        "🚀 *Премиум-доступ ArtBazar AI*\n\n"
        "Премиум открывает полный доступ без ограничений:\n"
        "• мгновенные ответы\n"
        "• глубокий анализ товара\n"
        "• расширенная аналитика ниши и рынка\n"
        "• приоритетная очередь\n\n"
        "📌 *Тарифы (ручная активация):*\n"
        "• 1 месяц — *490 сом*\n"
        "• 6 месяцев — *1990 сом*\n"
        "• 1 год — *2990 сом*\n\n"
        "🧾 После оплаты менеджер вручную включает премиум.\n"
        "Отправь чек менеджеру, чтобы активировать доступ.\n\n"
        "🧑‍💼 *Менеджер:* @Artbazar_support\n"
        "Оплата проходит быстро, активация — в течение 1–5 минут."
    )

    await message.answer(text, parse_mode="Markdown")
